# Задача 2. В зоопарк отправили отчёт о новом поступлении
# зверей с ошибкой, в результате которой некоторые данные не
# расшифровались. Расшифруйте данные. Определите, в какой
# клетке находится лев. Номер клетки совпадает с номером
# строки.
def Task002():
    animals = ['010100001100001001010011001011000000',
                '000001011100001011',
                '001011001111010011',
                '010010010011001111010001001111000111',
                '001100000101000010',
                '001011010001001111001100001001001011',
                '001101010100001100',
                '000001000000010001010010010100001011',
                '000011000101010000000000010001000100',
                '010010001111001101',
                '010010001111000001000000001011000000',
                '011000001001000111']
    alphabet = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
    text = []
    for j in animals:
        for i in range(0, len(j), 6):
            binary = (j[i: i+6])
            decimal = 0
            for k in binary:
                decimal *= 2
                decimal += int(k)
            text.append(alphabet[decimal])
        text.append(" ")
    sentence = "".join(text)
    print(sentence)
Task002()
